#############################
# Cask apps (GUI applications)
#############################

cask "1password"
cask "appcleaner"
cask "arc"
cask "affinity-designer"
cask "affinity-publisher"
cask "affinity-photo"
cask "brave-browser"
cask "backblaze"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "logi-options-plus"
cask "microsoft-auto-update"
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-teams"
cask "microsoft-outlook"
cask "obsidian"
cask "raycast"
cask "raindropio"
cask "slack"
cask "spotify"
cask "tidal"
cask "signal"
cask "visual-studio-code"
cask "windsurf"
cask "whatsapp"
cask "ghostty"

#############################
# Brew formulas (CLI tools)
#############################

brew "fish"                  # modern shell
brew "fnm"                   # fast Node.js version manager
brew "gh"                    # GitHub CLI
brew "git"                   # Git version control
brew "grep"                  # GNU grep (replaces macOS default)
